----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wsr\Dropbox\2019S\571\ECON571_lab_2019S\Lab\logs/Lab6-supplimentary.log
  log type:  text
 opened on:  10 Mar 2019, 21:37:36

. 
. ***** Omitted variable bias *****
. use data/WAGE1, clear

. * Check the correlations
. corr lwage female tenure
(obs=526)

             |    lwage   female   tenure
-------------+---------------------------
       lwage |   1.0000
      female |  -0.3737   1.0000
      tenure |   0.3255  -0.1979   1.0000


. * Assume the true model is log(wage) = b1 + b2*female + b3*tenure
. reg lwage female tenure

      Source |       SS       df       MS              Number of obs =     526
-------------+------------------------------           F(  2,   523) =   67.64
       Model |  30.4831298     2  15.2415649           Prob > F      =  0.0000
    Residual |  117.846622   523  .225328148           R-squared     =  0.2055
-------------+------------------------------           Adj R-squared =  0.2025
       Total |  148.329751   525   .28253286           Root MSE      =  .47469

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3421323    .042267    -8.09   0.000    -.4251663   -.2590984
      tenure |   .0192648   .0029255     6.59   0.000     .0135176    .0250119
       _cons |   1.688842   .0343675    49.14   0.000     1.621326    1.756357
------------------------------------------------------------------------------

. scalar b2 = _b[female]

. scalar b3 = _b[tenure]

. * Omit tenure: log(wage) = a1 + a2*female
. reg lwage female

      Source |       SS       df       MS              Number of obs =     526
-------------+------------------------------           F(  1,   524) =   85.04
       Model |  20.7120004     1  20.7120004           Prob > F      =  0.0000
    Residual |  127.617751   524  .243545326           R-squared     =  0.1396
-------------+------------------------------           Adj R-squared =  0.1380
       Total |  148.329751   525   .28253286           Root MSE      =   .4935

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3972175   .0430732    -9.22   0.000    -.4818349   -.3126001
       _cons |    1.81357   .0298136    60.83   0.000     1.755001    1.872139
------------------------------------------------------------------------------

. scalar a2 = _b[female]

. * Auxiliary model: tenure = c1 + c2*female
. reg tenure female

      Source |       SS       df       MS              Number of obs =     526
-------------+------------------------------           F(  1,   524) =   21.36
       Model |  1073.26518     1  1073.26518           Prob > F      =  0.0000
    Residual |  26327.9839   524   50.244244           R-squared     =  0.0392
-------------+------------------------------           Adj R-squared =  0.0373
       Total |   27401.249   525  52.1928553           Root MSE      =  7.0883

------------------------------------------------------------------------------
      tenure |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -2.859373    .618672    -4.62   0.000    -4.074755   -1.643991
       _cons |   6.474453   .4282209    15.12   0.000     5.633212    7.315693
------------------------------------------------------------------------------

. scalar c2 = _b[female]

. 
. display "The true b2 is: " b2
The true b2 is: -.34213234

. display "The estimated b2 that is biased is: " a2
The estimated b2 that is biased is: -.39721747

. display "The bias of tenure is b3*c2: " b3*c2
The bias of tenure is b3*c2: -.05508514

. 
. 
. ***** Near multicolinearity *****
. use data/multicoll, clear

. corr y x1 x2
(obs=100)

             |        y       x1       x2
-------------+---------------------------
           y |   1.0000
          x1 |   0.2400   1.0000
          x2 |   0.2500   0.9500   1.0000


. reg y x1 x2

      Source |       SS       df       MS              Number of obs =     100
-------------+------------------------------           F(  2,    97) =    3.24
       Model |  55.7446186     2  27.8723093           Prob > F      =  0.0436
    Residual |  835.255432    97  8.61088074           R-squared     =  0.0626
-------------+------------------------------           Adj R-squared =  0.0432
       Total |  891.000051    99  9.00000051           Root MSE      =  2.9344

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          x1 |   .0153846   .1889008     0.08   0.935    -.3595312    .3903005
          x2 |   .1353846   .1889008     0.72   0.475    -.2395313    .5103004
       _cons |   10.49231   .6655404    15.77   0.000     9.171394    11.81322
------------------------------------------------------------------------------

. * Evidence of near multicolinearity: 
. * t stats for x1 and x2 are small but the overall F is large
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
          x1 |     10.26    0.097500
          x2 |     10.26    0.097500
-------------+----------------------
    Mean VIF |     10.26

. * As a post-estimation diagnosis, VIF is quite large.
. 
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\wsr\Dropbox\2019S\571\ECON571_lab_2019S\Lab\logs/Lab6-supplimentary.log
  log type:  text
 closed on:  10 Mar 2019, 21:37:36
----------------------------------------------------------------------------------------------------------------------------
