--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Dropbox\2018S\571\Econ571_Lab\HW/HW9.log
  log type:  text
 opened on:  21 Apr 2018, 17:51:06

. use data/loanapp

. 
. * Check data
. codebook approve black hispan unem hrat married chis pubrec mortno vr

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
approve                                                                                                                                                                                (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/1989

            tabulation:  Freq.  Value
                           244  0
                          1745  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
black                                                                                                                                                                                  (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/1989

            tabulation:  Freq.  Value
                          1792  0
                           197  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
hispan                                                                                                                                                                                 (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/1989

            tabulation:  Freq.  Value
                          1878  0
                           111  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
unem                                                                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1.8,10.6]                   units:  .1
         unique values:  10                       missing .:  0/1989

                  mean:    3.8823
              std. dev:   2.16413

           percentiles:        10%       25%       50%       75%       90%
                                 2       3.1       3.2       3.9       5.3

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
hrat                                                                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,72]                       units:  .01
         unique values:  451                      missing .:  0/1989

                  mean:   24.7909
              std. dev:   7.11946

           percentiles:        10%       25%       50%       75%       90%
                              15.7        21     25.77        29        32

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
married                                                                                                                                                                                (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  3/1989

            tabulation:  Freq.  Value
                           678  0
                          1308  1
                             3  .

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
chist                                                                                                                                                                                  (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/1989

            tabulation:  Freq.  Value
                           323  0
                          1666  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
pubrec                                                                                                                                                                                 (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/1989

            tabulation:  Freq.  Value
                          1852  0
                           137  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
mortno                                                                                                                                                                                 (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/1989

            tabulation:  Freq.  Value
                          1329  0
                           660  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
vr                                                                                                                                                                                     (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/1989

            tabulation:  Freq.  Value
                          1174  0
                           815  1

. 
. * Probit
. probit approve i.black i.hispan unem hrat i.married i.chis i.pubrec i.mortno i.vr

Iteration 0:   log likelihood = -739.95364  
Iteration 1:   log likelihood = -626.03327  
Iteration 2:   log likelihood = -624.46425  
Iteration 3:   log likelihood = -624.46062  
Iteration 4:   log likelihood = -624.46062  

Probit regression                                 Number of obs   =       1986
                                                  LR chi2(9)      =     230.99
                                                  Prob > chi2     =     0.0000
Log likelihood = -624.46062                       Pseudo R2       =     0.1561

------------------------------------------------------------------------------
     approve |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.black |  -.6220026   .1108667    -5.61   0.000    -.8392973    -.404708
    1.hispan |  -.5499812   .1462119    -3.76   0.000    -.8365512   -.2634111
        unem |  -.0449744   .0167123    -2.69   0.007    -.0777299   -.0122189
        hrat |  -.0135118   .0053481    -2.53   0.012    -.0239938   -.0030298
   1.married |   .1938103   .0822751     2.36   0.018     .0325541    .3550665
     1.chist |   .6008097   .0949649     6.33   0.000     .4146819    .7869374
    1.pubrec |  -.8464303   .1248049    -6.78   0.000    -1.091043   -.6018173
    1.mortno |   .2099537   .0922853     2.28   0.023     .0290779    .3908296
        1.vr |  -.1938428   .0796688    -2.43   0.015    -.3499908   -.0376949
       _cons |   1.343433   .1889474     7.11   0.000     .9731033    1.713763
------------------------------------------------------------------------------

. predict yhat_probit
(option pr assumed; Pr(approve))
(3 missing values generated)

. 
. * OLS
. reg approve i.black i.hispan unem hrat i.married i.chis i.pubrec i.mortno i.vr

      Source |       SS       df       MS              Number of obs =    1986
-------------+------------------------------           F(  9,  1976) =   37.45
       Model |  31.1877513     9   3.4653057           Prob > F      =  0.0000
    Residual |  182.834404  1976  .092527532           R-squared     =  0.1457
-------------+------------------------------           Adj R-squared =  0.1418
       Total |  214.022155  1985  .107819725           Root MSE      =  .30418

------------------------------------------------------------------------------
     approve |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.black |   -.158649   .0236064    -6.72   0.000     -.204945   -.1123529
    1.hispan |  -.1200139    .030081    -3.99   0.000    -.1790077   -.0610201
        unem |  -.0082774   .0031605    -2.62   0.009    -.0144756   -.0020792
        hrat |    -.00245   .0009706    -2.52   0.012    -.0043535   -.0005464
   1.married |     .03383   .0147329     2.30   0.022     .0049363    .0627237
     1.chist |   .1406277   .0194096     7.25   0.000     .1025623    .1786931
    1.pubrec |  -.2597639   .0282609    -9.19   0.000    -.3151881   -.2043397
    1.mortno |   .0326952   .0149972     2.18   0.029     .0032833    .0621071
        1.vr |  -.0321291   .0140421    -2.29   0.022     -.059668   -.0045902
       _cons |   .8722535   .0353037    24.71   0.000     .8030171    .9414899
------------------------------------------------------------------------------

. predict yhat_ols
(option xb assumed; fitted values)
(3 missing values generated)

. 
. * Correlation
. correlate yhat_probit yhat_ols
(obs=1986)

             | yhat_p~t yhat_ols
-------------+------------------
 yhat_probit |   1.0000
    yhat_ols |   0.9750   1.0000


. 
. * Count yhat_ols, excluding missing values.
. count if yhat_ols ~= .
 1986

. count if yhat_ols > 1 & yhat_ols ~= .
   87

. count if yhat_ols < 0 & yhat_ols ~= .
    0

. 
. log close
      name:  <unnamed>
       log:  D:\Dropbox\2018S\571\Econ571_Lab\HW/HW9.log
  log type:  text
 closed on:  21 Apr 2018, 17:51:07
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
